anal_sims/anal_copies/n4long1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0.05)
    (0.6 0 -0.05)
    (0 0.1 -0.05)
    (0.6 0.1 -0.05)
    (0.9 0.1 -0.05)
    (0 1 -0.05)
    (0.6 1 -0.05)
    (0.9 1 -0.05)
    (0 0 0.05)
    (0.6 0 0.05)
    (0 0.1 0.05)
    (0.6 0.1 0.05)
    (0.9 0.1 0.05)
    (0 1 0.05)
    (0.6 1 0.05)
    (0.9 1 0.05)
    (0.6 0.2 -0.05) // 16
    (0.6 0.2 0.05) // 17
    (0.9 0.2 -0.05) //18
    (0.9 0.2 0.05) // 19
    (3 0.2 -0.05) //20
    (3 0.2 0.05) //21
    (3 1 -0.05) //22
    (3 1 0.05) //23
    (0 0.2 -0.05) //24
    (0 0.2 0.05) //25

);

blocks
(
 hex (0 1 3 2 8 9 11 10)   (96 16 1) simpleGrading (1 1 1)

 hex (2 3 16 24 10 11 17 25) (96 16 1) simpleGrading (1 1 1)

 hex (24 16 6 5 25 17 14 13) (96 128 1) simpleGrading (1 1 1)

 hex (3 4 18 16 11 12 19 17) (48 16 1) simpleGrading (1 1 1)

 hex (16 18 7 6 17 19 15 14) (48 128 1) simpleGrading (1 1 1)

 hex (18 20 22 7 19 21 23 15) (336 128 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 10 2)
            (2 10 25 24)
            (24 25 13 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (20 22 23 21)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 1 9 8)
        );
    }
    top
    {
        type patch;
        faces
        (
            (5 13 14 6)
            (6 14 15 7)
            (7 15 23 22)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (1 3 11 9)
            (3 4 12 11)
            (4 18 19 12)
            (18 20 21 19)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
